package com.dahua.graph.shortestPath;

import com.dahua.graph.CommonVertex;

/**
 * 邻接矩阵
 */
public class ShortPathGraph {

    // 顶点表
    CommonVertex[] commonVertices = {};

    // 邻接矩阵，用来存放顶点和弧
    public int[][] vertices = {
            {0,1,5,25535,25535,25535,25535,25535,25535}, // v0
            {1,0,3,7,5,25535,25535,25535,25535},  // v1
            {5,3,0,25535,1,7,25535,25535,25535},  // v2
            {25535,7,25535,0,2,25535,3,25535,25535},  // v3
            {25535,5,1,2,0,3,6,9,25535},  // v4
            {25535,25535,7,25535,3,0,25535,5,25535},  // v5
            {25535,25535,25535,3,6,25535,0,2,7},  // v6
            {25535,25535,25535,25535,9,5,2,0,4},  // v7
            {25535,25535,25535,25535,25535,25535,7,4,0},  // v8
    };

    public int numVertexes = 9;

}
